src/Documents/ИС_АЛИ_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_АЛИ_Заказ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyer_country_code</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyer_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyer_phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>total_amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delivery_address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>order_lines</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>30</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>item_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>product_source_id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>30</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>sku_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>sku_code</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>total_amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>item_price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>buyer_comment</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>discount_currency</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>original_discount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураАли</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_АЛИ_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариацияАли</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>pre_split_postings</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>30</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>num_id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>order_line_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>item_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>sku_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>product_source_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>item_price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураАли</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_АЛИ_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариацияАли</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>logistics_type</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>height</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>weight</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>width</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>length</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ИС_АЛИ_СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_АЛИ_СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Created</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InProgress</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Finished</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cancelled</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИС_АЛИ_Заказ/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИС_MP_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Список.ТекстЗапроса = ИС_АЛИ_Сервер.ПолучитьТекстЗапросаСборочныхЗаданий();
	Список.ОсновнаяТаблица = "Документ.ИС_АЛИ_Заказ";
	
	ОтборОтправлений = "Все";
	
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады") Тогда	
		Элементы.РасходныйОрдер.Видимость = Ложь;	
	КонецЕсли;                               
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
	ПрименитьНастрокиПрофиля();
	УстановитьОтборыОтправлений();
    ЗаполнитьОтборОтправлений();
	УстановитьДатуПоследнегоЗаказа();
    Элементы.СписокТоваров.Видимость = ОтображатьСоставОтправлений;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	ПрименитьНастрокиПрофиля();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтображатьСоставОтправлений Тогда
		
		МассивСтрок = Элементы.Список.ВыделенныеСтроки;
		
		Если МассивСтрок = Неопределено Или МассивСтрок.Количество() = 0 Тогда 
			ЗаполнитьОтборОтправлений();                                       
			Возврат;
		КонецЕсли;
		
		ЗаполнитьОтборОтправлений(МассивСтрок);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура ОтображатьСоставОтправленийПриИзменении(Элемент)
	
	Элементы.СписокТоваров.Видимость = ОтображатьСоставОтправлений;
	
	Если ОтображатьСоставОтправлений Тогда
		
		МассивСтрок = Элементы.Список.ВыделенныеСтроки;
		
		Если МассивСтрок = Неопределено Или МассивСтрок.Количество() = 0 Тогда 
			ЗаполнитьОтборОтправлений();                                       
			Возврат;
		КонецЕсли;
		
		ЗаполнитьОтборОтправлений(МассивСтрок);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура ОтборОтправленийПриИзменении(Элемент)
	УстановитьОтборыОтправлений();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные; 
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.Заказ Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Элемент.ТекущиеДанные.Заказ.Пустая() Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Заказ);
	
	ИначеЕсли Поле = Элементы.Реализация Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Реализация) Тогда
			Возврат;
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.Реализация);
		Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заказ", Элемент.ТекущиеДанные.Заказ);
			ОткрытьФорму("ОбщаяФорма.ИС_WB_ФормаРТУ", ПараметрыФормы);
		КонецЕсли
		
	//+ ИнфоСофт Конышев А.Е. 10.12.24 УА #77940
	ИначеЕсли Поле = Элементы.РасходныйОрдер Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.РасходныйОрдер) Тогда
			Возврат;
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.РасходныйОрдер) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.РасходныйОрдер);
		КонецЕсли
		
	//- ИнфоСофт Конышев А.Е. 10.12.24 УА #77940
	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.11.23 УА #55166

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура ЗагрузитьОтправления(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "ПолучениеСборочныхЗаданийАли");
	
	Если Не РеглРаботает Тогда    
		
		ДлительнаяОперация = ЗагрузитьОтправленияНаСервере(Профиль, ЗагружатьЗаказыС, УникальныйИдентификатор);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеЗаказовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжидание"].Видимость = Истина;		
		
		//ЗагрузитьСборочныеЗаданияНаСервере(Профиль, ДатаПоследнегоСборочногоЗадания);		
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по загрузке заказов, обновите форму чуть позже");
	КонецЕсли;                                      
	//Элементы.Список.Обновить();
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;

	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "ОбновлениеСтатусовСборочныхЗаданийАли");
	
	Если Не РеглРаботает Тогда    
		
		ДлительнаяОперация = ОбновитьСтатусыНаСервере(Профиль, УникальныйИдентификатор);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьСтатусыЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжиданиеСтатусы"].Видимость = Истина;		
		
		//ОбновитьСтатусыНаСервере(Профиль);		
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по загрузке заказов, обновите форму чуть позже");
	КонецЕсли;                                      
	//Элементы.Список.Обновить();
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура СоздатьЗаказы(Команда)
	
	ОчиститьСообщения();
    
	Если Не ЗначениеЗаполнено(Профиль) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьЗаказыНаСервере(Профиль, ВыделенныеСтроки);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура СоздатьРеализации(Команда)

	ОчиститьСообщения();
    
	Если Не ЗначениеЗаполнено(Профиль) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьРеализацииНаСервере(Профиль, ВыделенныеСтроки);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573
&НаКлиенте
Процедура ПрикрепитьКиз(Команда)
	
	ОчиститьСообщения();
    
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(
	 		"Для прикрепления КиЗов нужно выделить необходимые заказы");
		Возврат;
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Профиль", Профиль);
	ПараметрыФормы.Вставить("СборочныеЗадания", ВыделенныеСтроки);
	
	ОткрытьФорму("Документ.ИС_АЛИ_Заказ.Форма.ФормаКиЗов", ПараметрыФормы, ЭтотОбъект);	 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаСервереБезКонтекста
Функция  ЗагрузитьОтправленияНаСервере(Профиль, ДатаПоследнегоСборочногоЗадания, УникальныйИдентификатор)
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
	"ИС_АЛИ_Сервер.ПолучитьСписокЗаказов", Профиль, ДатаПоследнегоСборочногоЗадания);
	
	//ИС_АЛИ_Сервер.ПолучитьСписокЗаказов(Профиль, ЗагружатьЗаказыС);
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207	               
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
              
//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаСервереБезКонтекста
Функция ОбновитьСтатусыНаСервере(Профиль, УникальныйИдентификатор)
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800         	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
	"ИС_АЛИ_Сервер.ПолучитьСтатусы", Профиль);
		
	//ИС_АЛИ_Сервер.ПолучитьСтатусы(Профиль);
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800 
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура ПрименитьНастрокиПрофиля()
	Список.Параметры.УстановитьЗначениеПараметра("Профиль", Профиль);	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура УстановитьДатуПоследнегоЗаказа()
	
    Если Не ЗначениеЗаполнено(Профиль) Тогда
		ЗагружатьЗаказыС = Дата(1, 1, 1);
		Возврат;
	КонецЕсли;

	ЗагружатьЗаказыС = ПолучитьДатуПоследнегоЗаказа(Профиль);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаСервереБезКонтекста   
Функция ПолучитьДатуПоследнегоЗаказа(Профиль)
	Возврат ИС_АЛИ_Сервер.ПолучитьДатуПоследнегоЗаказа(Профиль); 	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура ЗаполнитьОтборОтправлений(Отбор = Неопределено)
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("Ссылка", Отбор);	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаКлиенте
Процедура УстановитьОтборыОтправлений()
    
    ВсеОтправления = Ложь;
    
	Статусы = Новый Массив;

	Если ОтборОтправлений = "Создан" Тогда                                                  		

		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_АЛИ_СтатусыЗаказов.Created"));
	
	ИначеЕсли ОтборОтправлений = "Обрабатывается" Тогда
	
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_АЛИ_СтатусыЗаказов.InProgress"));
			
	ИначеЕсли ОтборОтправлений = "Завершен" Тогда
			
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_АЛИ_СтатусыЗаказов.Finished"));
						
	ИначеЕсли ОтборОтправлений = "Отменен" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_АЛИ_СтатусыЗаказов.Cancelled"));
				
	Иначе // Все
	
		ВсеОтправления = Истина;
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_АЛИ_СтатусыЗаказов.ПустаяСсылка")); 
			
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВсеОтправления", ВсеОтправления); 
	Список.Параметры.УстановитьЗначениеПараметра("Статусы", Статусы);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408


//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаСервереБезКонтекста
Процедура СоздатьЗаказыНаСервере(Профиль, МассивОтправлений)
	ИС_АЛИ_Сервер.СоздатьЗаказы(Профиль, МассивОтправлений);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408 

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
&НаСервереБезКонтекста
Процедура СоздатьРеализацииНаСервере(Профиль, МассивОтправлений)
	ИС_АЛИ_Сервер.СоздатьРеализации(Профиль, МассивОтправлений);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Функция ПараметрыОжидания()

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);	
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	Возврат ПараметрыОжидания;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Процедура ПолучениеЗаказовЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы["КартинкаОжидание"].Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли; 
	
	Элементы.Список.Обновить();
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Процедура ОбновитьСтатусыЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы["КартинкаОжиданиеСтатусы"].Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаСервереБезКонтекста
Функция ПроверитьРегламетноеЗаданиеНаСервере(Профиль, ИмяКоманды)
	
	РеглАктивен = Ложь;
	
	Если Не РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		
		УникальныйИдентификатор = ИС_MP_РаботаСРегламентнымиЗаданиями.ПолучитьУникальныйИдентификаторРегламентогоЗадания(Профиль, ИмяКоманды);
		
		Если ЗначениеЗаполнено(УникальныйИдентификатор) Тогда
			
			Попытка
				УстановитьПривилегированныйРежим(Истина);
				РегламентноеЗадание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(УникальныйИдентификатор);
				
				РеглАктивен = ИС_MP_РаботаСРегламентнымиЗаданиями.ФоновоеЗаданиеАктивно(РегламентноеЗадание);
				УстановитьПривилегированныйРежим(Ложь);	 
			Исключение
				РеглАктивен = Ложь;
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РеглАктивен;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

#КонецОбласти
